IDEA StatiCa Open Model
CutData.NormalVector Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Plane normal
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public Vector3D NormalVector { get; set; }
Public Property NormalVector As Vector3D
	Get
	Set
public:
property Vector3D^ NormalVector {
	Vector3D^ get ();
	void set (Vector3D^ value);
}
Property Value
Type: Vector3D
See Also
Reference
CutData Class
IdeaRS.OpenModel.Connection Namespace